DataProcessors/бит_ЗаполнениеАдресаИзКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ЗаполнениеАдресаИзКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/бит_ЗаполнениеАдресаИзКонтактнойИнформации/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Запустить(Команда)
	ЗапуститьНаСервере();
    Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗапуститьНаСервере()
	битЗаполнениеПочтовогоАдресаИзКонтактнойИнформации();	
КонецПроцедуры

Функция битЗаполнениеПочтовогоАдресаИзКонтактнойИнформации()

	для каждого стрТаблицаРезультата из таблицаАдресов цикл
		
		если стрТаблицаРезультата.АдресКонтактнойИнформации <> "" тогда			
			адресИзКонтактов = бит_УправлениеКонтактнойИнформациейНовый.ПолучитьАдресБСП(стрТаблицаРезультата.АдресКонтактнойИнформации);
			
			если Строка(адресИзКонтактов.Представление) <> "" тогда           			 
			  объектЛицевогоСчета = стрТаблицаРезультата.Здание.ПолучитьОбъект();
			  
			  если стрТаблицаРезультата.АдресКонтактнойИнформации <> объектЛицевогоСчета.ПочтовыйАдрес и 
				                       объектЛицевогоСчета <> справочники.бит_СписокЗданий.ПустаяСсылка() тогда
				объектЛицевогоСчета.ПочтовыйАдрес = адресИзКОнтактов.Представление;
				объектЛицевогоСчета.Записать();
			  конецесли;			  
			конецесли;  			
		конецесли;		
		
	конеццикла;	

КонецФункции // битЗаполнениеПочтовогоАдресаИзКонтактнойИнформации()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	верcияБСР = СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
	
	ЗаполнитьСписок();
	
КонецПроцедуры

Процедура ЗаполнитьСписок ()
	
	таблицаАдресов.Очистить();
	
	запрос = новый Запрос;
	
	запрос.Текст = "ВЫБРАТЬ
	               |	бит_СписокЗданий.Ссылка КАК Ссылка,
	               |	бит_СписокЗданий.ПочтовыйАдрес КАК ПочтовыйАдрес,
	               |	бит_СписокЗданий.КонтактнаяИнформация.(
	               |		Значение КАК Значение,
	               |		Представление КАК Представление
	               |	) КАК КонтактнаяИнформация
	               |ИЗ
	               |	Справочник.бит_СписокЗданий КАК бит_СписокЗданий";
	
    таблицаРезультата = запрос.Выполнить().Выгрузить();
	
	для каждого стрКонтактов из таблицаРезультата цикл
		
	 если стрКонтактов.КонтактнаяИнформация <> неопределено и стрКонтактов.КонтактнаяИнформация.Количество() > 0 тогда	 
		 стрАдресов = таблицаАдресов.Добавить(); 
		 
		 если стрКонтактов.КонтактнаяИнформация[0].Значение <> "" тогда
		  адресИзКонтактов = бит_УправлениеКонтактнойИнформациейНовый.ПолучитьАдресБСП(стрКонтактов.КонтактнаяИнформация[0].Значение);
	     конецесли;
	  
	     если стрКонтактов.КонтактнаяИнформация[0].Представление <> "" тогда
		  адресИзКонтактов = бит_УправлениеКонтактнойИнформациейНовый.ПолучитьАдресБСП(стрКонтактов.КонтактнаяИнформация[0].Представление);
		 конецесли;
		 
		 если ЗначениеЗаполнено(адресИзКонтактов) тогда 
		  стрАдресов.АдресКонтактнойИнформации = адресИзКонтактов.Представление;
		  стрАдресов.ПочтовыйАдрес = стрКонтактов.ПочтовыйАдрес;  	
		  стрАдресов.Здание = стрКонтактов.Ссылка.Ссылка; 
		  стрАдресов.Организация = стрКонтактов.Ссылка.Организация; 
	     конецесли;
	  
	  конецесли;
	конеццикла;    
	
КонецПроцедуры	


&НаСервереБезКонтекста
Процедура таблицаАдресовПередНачаломДобавленияНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура таблицаАдресовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	таблицаАдресовПередНачаломДобавленияНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура таблицаАдресовАдресКонтактнойИнформацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	 УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопрос() Экспорт

  Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтотОбъект);
  ПоказатьВопрос(Оповещение, "Заполнить почтовые адреса из контактной информации?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет, "Заполнение почтовых адресов из контактной информации");

КонецПроцедуры


&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, Параметры) Экспорт                                                                                  

 Если Результат = КодВозвратаДиалога.Да Тогда

   битЗаполнениеПочтовогоАдресаИзКонтактнойИнформации();	

 КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ЗадатьВопрос();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
    Если ИмяСобытия = "ЗакрытьФормуОбработки" Тогда 
        Закрыть();
    КонецЕсли;    
КонецПроцедуры
